In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [10]:
dates = pd.date_range('20130101', periods=6)

In [11]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [13]:
df

                   A         B         C         D
2013-01-01 -0.729273  1.798642 -0.822580  0.642993
2013-01-02 -0.922513  0.434538 -1.199837  0.238247
2013-01-03  0.309296  0.157277  1.049249 -0.160018
2013-01-04  0.102532 -1.487029  1.113921  0.310361
2013-01-05  1.465179 -1.883021  0.909188 -0.850122
2013-01-06 -0.449234 -2.192445  1.295853  0.532353

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.037336 -0.528673  0.390966  0.118969
std    0.875128  1.570703  1.099702  0.550149
min   -0.922513 -2.192445 -1.199837 -0.850122
25%   -0.659263 -1.784023 -0.389638 -0.060452
50%   -0.173351 -0.664876  0.979219  0.274304
75%    0.257605  0.365223  1.097753  0.476855
max    1.465179  1.798642  1.295853  0.642993

In [16]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.642993 -0.822580  1.798642 -0.729273
2013-01-02  0.238247 -1.199837  0.434538 -0.922513
2013-01-03 -0.160018  1.049249  0.157277  0.309296
2013-01-04  0.310361  1.113921 -1.487029  0.102532
2013-01-05 -0.850122  0.909188 -1.883021  1.465179
2013-01-06  0.532353  1.295853 -2.192445 -0.449234

In [17]:
df['A']

2013-01-01   -0.729273
2013-01-02   -0.922513
2013-01-03    0.309296
2013-01-04    0.102532
2013-01-05    1.465179
2013-01-06   -0.449234
Freq: D, Name: A, dtype: float64

In [21]:
#first row
df.loc[dates[0]]

A   -0.922513
B    0.434538
C   -1.199837
D    0.238247
Name: 2013-01-02 00:00:00, dtype: float64

In [27]:
#all rows, first two cols
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.729273  1.798642
2013-01-02 -0.922513  0.434538
2013-01-03  0.309296  0.157277
2013-01-04  0.102532 -1.487029
2013-01-05  1.465179 -1.883021
2013-01-06 -0.449234 -2.192445

In [28]:
#Showing label slicing
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.922513  0.434538
2013-01-03  0.309296  0.157277
2013-01-04  0.102532 -1.487029

In [29]:
df.loc['20130102',['A','B']]

A   -0.922513
B    0.434538
Name: 2013-01-02 00:00:00, dtype: float64

In [30]:
df.iloc[3]

A    0.102532
B   -1.487029
C    1.113921
D    0.310361
Name: 2013-01-04 00:00:00, dtype: float64

In [31]:
df.iloc[1]

A   -0.922513
B    0.434538
C   -1.199837
D    0.238247
Name: 2013-01-02 00:00:00, dtype: float64

In [32]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.102532 -1.487029
2013-01-05  1.465179 -1.883021

In [33]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.922513 -1.199837
2013-01-03  0.309296  1.049249
2013-01-05  1.465179  0.909188

In [34]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.922513  0.434538 -1.199837  0.238247
2013-01-03  0.309296  0.157277  1.049249 -0.160018

In [35]:
df.iloc[:,1:3]

                   B         C
2013-01-01  1.798642 -0.822580
2013-01-02  0.434538 -1.199837
2013-01-03  0.157277  1.049249
2013-01-04 -1.487029  1.113921
2013-01-05 -1.883021  0.909188
2013-01-06 -2.192445  1.295853

In [36]:
df.iloc[1,1]

0.4345379812835584

In [39]:
df[df.A > 0]

                   A         B         C         D
2013-01-03  0.309296  0.157277  1.049249 -0.160018
2013-01-04  0.102532 -1.487029  1.113921  0.310361
2013-01-05  1.465179 -1.883021  0.909188 -0.850122

In [38]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  1.798642       NaN  0.642993
2013-01-02       NaN  0.434538       NaN  0.238247
2013-01-03  0.309296  0.157277  1.049249       NaN
2013-01-04  0.102532       NaN  1.113921  0.310361
2013-01-05  1.465179       NaN  0.909188       NaN
2013-01-06       NaN       NaN  1.295853  0.532353

In [40]:
df2 = df.copy()

In [45]:
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.729273  1.798642 -0.822580  0.642993    one
2013-01-02 -0.922513  0.434538 -1.199837  0.238247    one
2013-01-03  0.309296  0.157277  1.049249 -0.160018    two
2013-01-04  0.102532 -1.487029  1.113921  0.310361  three
2013-01-05  1.465179 -1.883021  0.909188 -0.850122   four
2013-01-06 -0.449234 -2.192445  1.295853  0.532353  three

In [46]:

df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.309296  0.157277  1.049249 -0.160018   two
2013-01-05  1.465179 -1.883021  0.909188 -0.850122  four

In [49]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [50]:
df['F'] = s1

In [51]:
df

                   A         B         C         D    F
2013-01-01 -0.729273  1.798642 -0.822580  0.642993  NaN
2013-01-02 -0.922513  0.434538 -1.199837  0.238247  1.0
2013-01-03  0.309296  0.157277  1.049249 -0.160018  2.0
2013-01-04  0.102532 -1.487029  1.113921  0.310361  3.0
2013-01-05  1.465179 -1.883021  0.909188 -0.850122  4.0
2013-01-06 -0.449234 -2.192445  1.295853  0.532353  5.0

In [52]:
df.mean()

A   -0.037336
B   -0.528673
C    0.390966
D    0.118969
F    3.000000
dtype: float64

In [53]:
df.mean(1)

2013-01-01    0.222446
2013-01-02   -0.089913
2013-01-03    0.671161
2013-01-04    0.607957
2013-01-05    0.728245
2013-01-06    0.837305
Freq: D, dtype: float64